{"files": {"Praxis": {"Schedule Management.pdf": null, "Delivery.pdf": null, "Governance.pdf": null, "Business Case Management.pdf": null, "Environment.pdf": null, "Life Cycle.pdf": null, "Overview.pdf": null, "Planning.pdf": null, "Benefits Management.pdf": null, "Integrative Management.pdf": null, "praxis-local-release-pdf.pdf": null, "Control.pdf": null, "Requirements Management.pdf": null, "Time Scheduling.pdf": null, "Project, Programme and Porfolio Management.pdf": null, "Scope Management.pdf": null, "Assurance.pdf": null, "Change control.pdf": null, "Knowledge Management.pdf": null, "Stakeholder Management.pdf": null, "questions.txt": null, "Resource Scheduling.pdf": null, "Configuration Management.pdf": null, "Risk Management.pdf": null, "Complexity.pdf": null}, "OEDT": {"12_30-_2_rep_DRILL_DEV_382385571.pdf": null, "Petroleum Act 1998.pdf": null, "30_12d-_11_rep_DRILL_DEV_368542506.pdf": null, "205_15-_1_rep_WELL_COMP_267802283.pdf": null, "Vralstad et al 2019.pdf": null, "206_21-_1_rep_ENG_ABAND_343460735.pdf": null, "22_30c-K1Z_rep_DRILL_HIST_252505697.pdf": null, "29_03b-_9_rep_29_03b-_9_rep_DRILL_HIST_253627541.pdf": null, "questions.txt": null, "Introduction to Permenant Plug & Abandonment of Wells.pdf": null, "30_12d-_11_rep_GEOL_GEOW_368645552.pdf": null, "The Marine Works EIA.pdf": null}, "Unilever": {"unilever-annual-report-and-accounts-2019.pdf": null, "Unilever-Annual-Report-and-Accounts-2018.pdf": null, "questions.txt": null}, "Risk": {"CBAFallacy - Oxford Projects Academy - Said Buisness School.pdf": null, "Project Risk Analysis and management Guide.pdf": null, "m_o_r_syllabus.pdf": null, "57r-09 - AACE Recommended Practice.pdf": null, "Nasa Cost Estimating.pdf": null, "Risk Analysis Data Sheet.pdf": null, "10Biases - Oxford Projects Academy - Said Buisness School.pdf": null, "Risk Tutorials.pdf": null, "DoD Cost Estimating Guide.pdf": null, "R-Patterson-Risk-paper-MPL-Nov-2009-as-on-NEC-website-Feb-2019.pdf": null, "NASA Risk Manageent Handbook.pdf": null, "interfacing-risk-and-earned-value-management_secure.pdf": null, "IPA_CostEstimatingRequirements.pdf": null, "updating-the-evidence-behind-the-optimism-bias-uplifts-for-transport-appraisals.pdf": null, "prioritising-project-risks.pdf": null, "questions.txt": null, "The NASA Analogy Software Cost Model Web-Based Cost Analysis Tool.pdf": null, "IPA_Cost_Estimating_Guidance.pdf": null, "Document Project Readiness by Estimate Class .pdf": null, "64r-11 - CPM Schedule Risk Modelling and Analysis- Special Considerations.pdf": null, "57r-09 - Integrated Cost and Schedule Risk Analysis using Risk Drivers and Mote Carlo Simulation of a CPM Model.pdf": null, "interfacing-risk-and-earned-value-management.pdf": null}}, "namespaces": ["Praxis", "OEDT", "Unilever", "Risk"], "questions": {"Example Questions of Praxis": ["What are the characteristics of a well specified requirement?", "What are the key features of the risk management plan?", "What are the inputs and outputs to the change control process?", "Which knowledge areas are related to the execution stage?", "What are the key components of a project charter according to the Praxis Framework?", "Can you provide examples of project objectives and success criteria outlined in the project initiation phase?", "What are the main steps involved in creating a project plan using the Praxis Framework?", "How does the Praxis Framework handle risk assessment and risk management during project planning?", "What are the best practices for managing project resources and progress during the execution phase?", "Can you provide examples of tools and techniques recommended by the Praxis Framework for monitoring project performance?", "How does the Praxis Framework handle change control and scope management during project execution?", "What are the methods suggested by the Praxis Framework to address and resolve project issues and deviations?", "What are the key activities and deliverables involved in the project closure phase based on the Praxis Framework?", "Can you provide examples of project documentation required for formal project closure as per the framework?", "What are the principles and practices of agile project management endorsed by the Praxis Framework?", "How does the Praxis Framework address iterative development and adaptive planning in agile projects?", "How does the Praxis Framework focus on benefits realization and value management throughout the project lifecycle?", "Can you provide examples of techniques used in the framework to measure and track project benefits?", "What strategies and methodologies does the Praxis Framework recommend for effective stakeholder engagement and communication?", "How does the framework address stakeholder analysis and management?"], "Example Questions of OEDT": ["What are the key stages of the decommissioning programme process?", "What are the key factors for understanding whether an EIA is required?", "What are the monitoring requirements to ensure compliance with environmental regulations?", "What are the guidelines and standards for the removal of offshore installations and structures?", "What lessons can be learned about the start of bunkering the bulk cement products?", "What lessons can be learned about the 17 ½” Drilling & 13 3/8” casing?", "Summarise the main causes of NPT events"], "Example Questions of Unilever": [" What are the strategic dependencies of our ongoing technological implementation projects?  ", " Which mitigation strategies are linked to the risk of poor project execution?  ", " What is our supply chain strategy associated with digital transformation?  ", " Which programmes are associated with winning through brand innovation and market competitiveness?  ", " What are the risks associated with potential business disruptions?  ", " Which areas of support are provided for our ongoing organizational transformation programmes?  ", " What models are we using for creating strategic value?  ", " How are our acquisition programmes linked with future partnerships strategies?  ", " What are the strategic dependencies for our net revenue management programme?  ", " What is our supply chain strategy for our logistics operations?  ", " How does innovation connect with our service offerings?  ", " What risks are associated with our strategic response to major geopolitical changes and what are their mitigations?  ", " How is executive sponsorship involved in our business transformation themes?  ", " How do our talent and capabilities strategies relate to our operations in specific regions?  ", " What key events or triggers are associated with our systems integration programmes?  ", " How do our strategic initiatives contribute to value creation?  ", " Which programmes are connected to the theme of responsible and sustainable living?  ", " What is the role of steering groups in the context of project management?  ", " How is our strategy theme related to agility and change management related to our service offerings?  ", " Which areas of support are involved in our data management enhancement programmes?  ", " What impact could poor project execution have on our ongoing acquisitions and disposals?  ", " How are we ensuring non-delivery of benefits risk is being mitigated in our revenue management programmes?  ", " What steps are we taking to prevent business disruption as a result of our strategic initiatives?  ", " How are we managing the risk of slowing digitisation pace in our supply chain themes?  ", " In what ways could a slowed technological change risk affect our data management enhancement programmes?  ", " How can we ensure that executive sponsorship and steering groups are effectively supporting our organizational transformation initiatives?  ", " Are regular progress updates being maintained for our key strategic initiatives and are there any significant updates?  ", " How are our links with digital programme teams contributing to systems integration efforts?  ", " Are appropriate personnel assigned for critical technological implementations?  ", "How are we monitoring the volume of our change programmes?  ", "Are we aligning our innovation and sourcing efforts with our overall value creation strategies?  ", "How is our talent and capabilities theme being reflected in our project acquisitions?  ", "Are our leadership standards being followed in all our project management practices?  ", "How is our supply chain strategy being applied to our key operational areas? ", "In the context of business transformation themes  how are we handling the risks and challenges associated with our operations? "], "Example Questions of Risk": ["what are the key steps recommended for conducting a risk assessment?", "what methodologies are suggested for estimating project costs in the defense sector?", "how does NASA identifies and manages risks in its projects?", "what updates or improvements have been made to the optimism bias uplifts for transport projects?", "can you explain the key considerations or challenges when performing schedule risk analysis using the CPM model?", "what are the benefits and outcomes of integrating risk management with earned value management?", "Can you provide an overview of the cost estimating requirements for large-scale projects?", "how is the Monte Carlo simulation applied to perform the integrated cost and schedule risk analysis"]}}